Tekla Open API Reference for Tekla Structures 2025
RadialGrid.RadialLabels Property
 The labels for the grid arcs.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string RadialLabels { get; set; }
Public Property RadialLabels As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RadialGrid Class
Tekla.Structures.Model Namespace